

// JS中的数据类型
/**
一、基本数据类型
* 1、数字(Number)：包括浮点数与整数
* 2、字符串(String)：包括由任意数量字符组成的序列
* 3、布尔值(Boolean)：包括true和false
* 4、Undefined：当我们试图访问一个不存在的变量时，就会得到一个特殊的值undefined。除此之外，使用已定义却未赋值的变量也会如此，以为js会自动将变量在初始化之前的值设定为undefined。而Undefined类型的值只有一个，那就是undefined
* 5、Null：只包含一个值的特殊数据类型。所谓的null值，通常是没有值或空值，不代表任何东西。null与undefined最大的不同在于，被赋予null的变量通常被认为是已经定义了的，只不过它不代表任何东西。
*
 *
 *
* 二、非基本数据类型(对象)
 * 数组
 * 字符串
 * .....等

 */





// JS中的变量和常量

/**
 * 变量：
 * 1、程序可操作的存储区的名称
 * 2、程序运行期间能改变的数据
 * 3、每个变量都有特定的类型
 * 变量的作用：将不同类型的数据存储到内存
 *
 *
 * 变量的定义：var 变量名;
 * 数据的存储：变量名 = 表达式;
 *
 *
 * 常量：程序运行期间不能改变的数据
 */